{"path":"home/philosophy","templateID":2,"sharedPropsHashes":{},"localProps":{"note":{"path":"home/philosophy","name":"Philosophy","parent":"home","contents":"<blockquote>\n<p>*&quot;The unexamined life is not worth living.&quot; - Socrates</p>\n</blockquote>\n<h2 id=\"the-purpose-of-philosophy-for-me\">The Purpose of Philosophy For Me</h2>\n<p>I want to think carefully about what I value so that achieving my goals has the greatest positive effect. This goal is one of my top priorities because success is a vector - it has a magnitude and a direction, and choosing the direction is the hard part. It&#39;s not enough to go somewhere. You have to go in the right direction otherwise you could end up like a soldier accidentally fighting for the wrong side - trying hard put not achieving your values. My goal is to find the most important values and plot my future course to achieve those values.</p>\n<p>It&#39;s not possible to ignore your future since you&#39;ll ultimately end up doing something. We&#39;re probably good at optimizing our lives in the short term but much less capable at long term planning, which makes sense given that the long term has been of little concern to people until now.</p>\n<p>This is where thought comes in. Careful thought can fill in the gap which intuition is not able to fill. The real value of deliberate thinking lies in optimizing our long term future.</p>\n<h2 id=\"ideas\">Ideas</h2>\n<p>Below is a list of philosophical ideas I support.</p>\n<p><a href=\"https://en.wikipedia.org/wiki/Determinism\">Determinism:</a> the idea that all events are determined by past events. An important implication of determinism is that free will is not possible. Since our actions are determined by past experiences and genes, our decisions are bounded by the past making free will impossible.</p>\n<p><a href=\"https://en.wikipedia.org/wiki/Absurdism\">Absurdism:</a> the scientific evidence we have accumulated so far suggests that the creation of our universe was a random improbable event and that there is no intrinsic meaning in the universe. One of the core ideas of absurdism is the human struggle to find meaning and purpose in an intrinsically meaningless universe.</p>\n<p><a href=\"https://en.wikipedia.org/wiki/Fallibilism\">Fallibilism</a>: there are no facts which are one-hundred percent true. All knowledge is to some degree uncertain because imperfect perceptions are the source of all knowledge.</p>\n","folder":1},"children_notes":[{"path":"home/philosophy/usefulQuestions","name":"Useful Questions","parent":"home/philosophy","contents":"<p>Asking questions or directs your mind towards solving problems. When problems are hard to solve, rephrasing the question can help make the problem easier.</p>\n<p>Below are some questions which might prompt you to think of something useful.</p>\n<h3 id=\"questions\">Questions</h3>\n<ul>\n<li>How is your ideal life different to your life at the moment?</li>\n<li>If you met your ideal self, what would he/she be like?</li>\n<li>What are the biggest problems in your life at the moment?</li>\n<li>What do you want your life to be like in ten or twenty years?</li>\n<li>If you continue doing what you are doing today, where will you be ten or twenty years?</li>\n<li>How could this be better?</li>\n<li>Who do I Want to be in 10 Years?</li>\n<li>What a perfect day in your life look like?</li>\n</ul>\n","folder":0}]}}
