{"path":"home/knowledge/health","templateID":2,"sharedPropsHashes":{},"localProps":{"note":{"path":"home/knowledge/health","name":"Health","parent":"home/knowledge","contents":"<h1 id=\"health\">health</h1>\n<p>This folder is concerned with physical health.</p>\n<p>Health is important because it affects your general quality of life. Good health is also relevant to productivity - it provides you with enough energy to achieve your goals.</p>\n","folder":3},"children_notes":[{"path":"home/knowledge/health/diet","name":"Diet","parent":"home/knowledge/health","contents":"<h1 id=\"diet\">diet</h1>\n<p>I have decided to replace about 40% of my caloric intake with Huel which is a meal replacement drink.</p>\n<ul>\n<li>Advantages:<ul>\n<li>Less of my time is consumed by cooking and eating.</li>\n<li>The price of Huel is similar to the price of groceries so it is more convenient at no extra expense.</li>\n</ul>\n</li>\n<li>Disadvantages:<ul>\n<li>It is important to eat a wide variety of foods for gut health. The more variety there is in your diet, the more diverse the colonies of bacteria are in your gut. The bacteria in your gut are thought to influence your mental health so it is important to eat a variety of fiber-rich foods. Huel is a somewhat monotonous food so I eat other fiber-rich foods to increase the variety in my diet.</li>\n<li>Tooth decay: our teeth evolved to chew on tough plants and meat which scraped food from our teeth. Huel tends to stick to your teeth which could cause tooth decay if your teeth are not cleaned regularly. To prevent tooth decay, I ensure that I brush my teeth twice per day. I also drink water throughout the day so that my teeth are cleaner.</li>\n</ul>\n</li>\n</ul>\n<p>On balance, Huel has definitely had a net positive effect on my life, mainly due to the fact that it saves time spent on cooking everyday. I will continue buying Huel because of this.</p>\n","folder":0},{"path":"home/knowledge/health/exercise","name":"Exercise","parent":"home/knowledge/health","contents":"<p>---</p>\n<p>tags: [&quot;Not started&quot;]</p>\n<p>---</p>\n","folder":0},{"path":"home/knowledge/health/sleep","name":"Sleep","parent":"home/knowledge/health","contents":"<h1 id=\"sleep\">sleep</h1>\n<p>Sleeping regular hours is important - I try to go to bed and wake up at the same time.</p>\n<p>Its generally a good idea to keep your sleep schedule roughly in sync with the sun where you wake up around sunrise and go to bed after the sun has set. Animals have evolved over the past 500 million years to function in sync with the natural daylight cycle. Therefore it makes sense to sleep that way for optimal health.</p>\n<p>I usually get around 8 hours of sleep. I find that to be an optimal balance between saving time and being well-rested.</p>\n<p>I try to wake up after a certain multiple of ninety minute intervals since sleep is made up of ninety minute cycles. Waking up at the end of a ninety minute interval ensures that you are refreshed. To wake up refreshed, sleep for one of the following times:</p>\n<p><img src=\"http://gdblogs.shu.ac.uk/b2006900/wp-content/uploads/sites/15/2014/10/sleep-cycle1.gif\" alt=\"source: sleepsync.com\"></p>\n<p>​ <em>source: sleepsync.com</em></p>\n<ul>\n<li>5 x 90 minutes = 450 minutes = 7.5 hours</li>\n<li>4 x 90 minutes = 360 minutes = 6 hours</li>\n<li>3 x 90 minutes = 270 minutes = 4.5 hours</li>\n</ul>\n<p>Note: each of the times above states the amount of time spent asleep not in bed. Add roughly 20 minutes to each of the times above to account for the fact that it takes some time to fall asleep.</p>\n","folder":0}]}}
