{"path":"home/mind/emotion","templateID":2,"sharedPropsHashes":{},"localProps":{"note":{"path":"home/mind/emotion","name":"Emotion","parent":"home/mind","contents":"<p>Emotions have a strong influence over our actions, and are probably a stronger determinant of what we do than our thoughts. Therefore, it&#39;s important to manage them if you want to live your life according to your intentions. </p>\n<blockquote>\n<p> <em>&quot;Is freedom anything else than the right to live as we wish? Nothing else.&quot; - Epictetus</em></p>\n</blockquote>\n<p>Sometimes emotions can stop us from living the way we intend. To live as freely as possible, we need to be able to regulate emotions when they are not appropriate to the situation at hand.</p>\n<h1 id=\"emotional-regulation\">Emotional Regulation</h1>\n<p>How to reduce emotions when they are not appropriate or useful:</p>\n<ul>\n<li><strong>Name emotions:</strong> Simply naming the emotion you are currently feeling helps to reduce its intensity. Say, &quot;I am&quot; followed by the emotion you are feeling.<a href=\"https://www.6seconds.org/2018/01/21/getting-unstuck-power-naming-emotions/\"><sup>1</sup></a></li>\n</ul>\n<h2 id=\"stress-reduction\">Stress Reduction</h2>\n<h3 id=\"short-term-techniques\">Short Term Techniques</h3>\n<ul>\n<li><strong>Focus on what you can control</strong>: re-frame situations so that you feel more in control by focusing on what you can control. <a href=\"https://www.sciencefocus.com/the-human-body/10-scientifically-proven-tips-to-beat-stress/\"><sup>2</sup></a></li>\n<li><strong>Take deep breaths</strong> <a href=\"https://www.stress.org/take-a-deep-breath\"><sup>3</sup></a></li>\n</ul>\n<h3 id=\"long-term-management\">Long Term Management</h3>\n<ul>\n<li><strong>Get regular exercise</strong></li>\n<li><strong>Get enough sleep</strong></li>\n</ul>\n","folder":2},"children_notes":[{"path":"home/mind/emotion/howToBeHappy","name":"How To Be Happy","parent":"home/mind/emotion","contents":"<p>Most people would agree that increasing happiness is desirable. After all, all other things being equal, who wouldn&#39;t want to be more happy?</p>\n<p>The science of happiness:</p>\n<p><a href=\"https://theweek.com/articles/770493/how-happy-according-science\">https://theweek.com/articles/770493/how-happy-according-science</a></p>\n<h2 id=\"summary\">Summary</h2>\n<ul>\n<li>Create meaningful connections with people</li>\n<li>Live in the moment. Do work you like and try to achieve flow. Don&#39;t focus too much on external signs of success such as wealth.</li>\n<li>Connect with nature: go to green spaces</li>\n<li>Exercise</li>\n</ul>\n","folder":0},{"path":"home/mind/emotion/sexuality","name":"Sexuality","parent":"home/mind/emotion","contents":"<h1 id=\"how-to-find-your-sexuality\">How to find Your Sexuality</h1>\n<p>Get the tinder app.</p>\n<p>Initially, display only women/men in your age range of choice.</p>\n<p>Out of one hundred swipes, record how many of them were to the right.</p>\n<p>To make this easier, I split up the task into ten groups of ten swipes, then added up the total number of right swipes and divided by one hundred to find the percentage of right swipes for each gender.</p>\n<p>For higher accuracy, ask this question, &quot;Would I want to go on a date with this person?&quot;. Swipe right if the answer is yes, otherwise swipe left. Also, be honest about your swipes.</p>\n<p>Now change the gender displayed to the opposite gender keeping the age range the same. Keep all other variables the same.</p>\n<p>Out of one hundred swipes of this gender (the opposite of the initial gender), record how many were to the right.</p>\n<p>Compare the number of right swipes for each gender. If you have a high percentage of right swipes for the opposite gender and a low percentage for your gender, then you are probably heterosexual. If you found the opposite pattern, then you are probably homosexual. A balanced percentage of right swipes between both genders suggests that you are bisexual.</p>\n<p>Note: this test only determines your preferences for physical attractiveness.</p>\n<h2 id=\"my-result\">My Result</h2>\n<p>I found that I swiped 58% (based on 100 swipes) to the right for both genders (in my age range: 18 - 22). Coincidentally, the figure happened to be exactly 58% for both genders!</p>\n<p>This means that, according to the data I&#39;ve collected, I am exactly bisexual - right between heterosexual and homosexual. However, there is bound to be some inaccuracies in this result so I&#39;d say I&#39;m roughly, as opposed to exactly bisexual. In other words, I might have a slight lean towards either gender.</p>\n","folder":0}]}}
