{"path":"home/mind/emotion","templateID":2,"sharedPropsHashes":{},"localProps":{"note":{"path":"home/mind/emotion","name":"Emotion","parent":"home/mind","contents":"<p>Emotions have a strong influence over our actions, and are probably a stronger determinant of what we do than our thoughts. Therefore, it&#39;s important to manage them if you want to live your life according to your intentions. </p>\n","folder":4},"children_notes":[{"path":"home/mind/emotion/emotionalRegulation","name":"Emotional Regulation","parent":"home/mind/emotion","contents":"<p>Observing negative emotions in detached way tends to blunt them. To do this, say to yourself, &quot;I&#39;m feel...&quot; followed by whatever emotion you are feeling.</p>\n<p>Taking deep breaths helps to reduce stress.</p>\n<h2 id=\"stoicism\">Stoicism</h2>\n<p>To be happier, learn to want what your already have.</p>\n<p>Don&#39;t try and control things you can&#39;t control. </p>\n<p>Foster a sense of control over the things you can control in your life. Experiments have shown that animals have the ability to extinguish stress when they feel in control over their situation.</p>\n<p>Imagine the things and people you take for granted and interact with the most would suddenly vanish and be gone forever. This’ll make you feel bad at first, but then you will be filled with gratitude.</p>\n","folder":0},{"path":"home/mind/emotion/howToBeHappy","name":"How To Be Happy","parent":"home/mind/emotion","contents":"<p>Most people would agree that increasing happiness is desirable. After all, all other things being equal, who wouldn&#39;t want to be more happy?</p>\n<p>The science of happiness:</p>\n<p><a href=\"https://theweek.com/articles/770493/how-happy-according-science\">https://theweek.com/articles/770493/how-happy-according-science</a></p>\n<h2 id=\"summary\">Summary</h2>\n<ul>\n<li>Create meaningful connections with people</li>\n<li>Live in the moment. Do work you like and try to achieve flow. Don&#39;t focus too much on external signs of success such as wealth.</li>\n<li>Connect with nature: go to green spaces</li>\n<li>Exercise</li>\n</ul>\n","folder":0},{"path":"home/mind/emotion/sexuality","name":"Sexuality","parent":"home/mind/emotion","contents":"<p>Your sexuality is an important part of your emotional and psychological well-being.</p>\n","folder":1}]}}
