{"path":"home/plans/reviews/feb","templateID":2,"sharedPropsHashes":{},"localProps":{"note":{"path":"home/plans/reviews/feb","name":"Feb","parent":"home/plans/reviews","contents":"<h2 id=\"review-of-philosophy-and-direction\">Review of Philosophy and Direction</h2>\n<p>This month, I feel I&#39;ve made some progress on understanding how to live and other related philosophical issues. So far though, I&#39;ve gained insights only through much mental effort. Recently however, I feel I&#39;ve developed enough of a understanding of many philosophical problems to make faster progress.</p>\n<p>My progress seems to be following an S-curve and I think I&#39;m approaching the middle of the curve. I expect to see diminishing returns soon so I&#39;ll begin concrete planning and execution as opposed to only thinking about things.</p>\n<p>Also, I think I have been more open to new ideas and less mentally rigid in the past month which is an improvement.</p>\n<p><strong>Next month</strong>: clarify your understanding of the source of values and motivation. Solve the direction problem or what you should do. Then create a guide for how to live, and a personal life plan. If you fail to make progress on these philosophical issues or are progressing too slowly, just start executing a backup life plan which you can then refine over time.</p>\n<p>I feel a sense of urgency about solving the problems above. Solving these problems is merely a means to an end where the end is the achievement of goals. Therefore, I need to solve these problems soon. I also think the insights I gain will be valuable to other people who are unsure about what to do.</p>\n<h2 id=\"directory\">Directory</h2>\n<p> Make the core section highly compact. This will ensure that I can edit everything and that I have only very high quality content there. </p>\n<p>Write about only the most general and valuable ideas. I think there is a limited supply of these so I expect the number of contributions I make to directory to decrease over time.</p>\n<h2 id=\"lifestyle\">Lifestyle</h2>\n<p>I&#39;m beginning to appreciate the importance of living a more balanced life. I think I can live a more varied lifestyle with a low impact to my productivity if I manage my time well and work efficiently.</p>\n<p><strong>Social life</strong>: spend more time with people.</p>\n<p><strong>College</strong>: I&#39;ve been getting my work done more quickly which is good.</p>\n<p><strong>Reading</strong>: I&#39;ve realized that thinking is a better use of my time than reading so I&#39;m reducing the amount of time I spend reading. Though bear in mind that the knowledge your acquire from reading supports good thinking. So read a little bit everyday.</p>\n<p><strong>Sleep</strong>: go to bed earlier.</p>\n<p><strong>Diet</strong>: eat a more varied diet and eat more calories.</p>\n<p><strong>mindset</strong>: focus on improving over being competent. Be more open to flaws and failure because they are opportunities to improve. Have more of a growth mindset instead of a fixed mindset.</p>\n","folder":0},"children_notes":[]}}
