{"path":"home/plans","templateID":2,"sharedPropsHashes":{},"localProps":{"note":{"path":"home/plans","name":"Plans","parent":"home","contents":"<p>Some future plans I have and reviews on how well I am following them.</p>\n<p>A plan is a set of actions arranged across time. What you have to figure out is which actions should be part of that plan and the order they should be in.</p>\n","folder":5},"children_notes":[{"path":"home/plans/2019Goals","name":"2019 Goals","parent":"home/plans","contents":"<h1 id=\"1-work\">1. Work</h1>\n<p>I value achievement and I believe work adds meaning to life. I don&#39;t think it&#39;s enough to be happy in the short term. It&#39;s important to have long term satisfaction, meaning and direction.</p>\n<h2 id=\"maximize-output\">Maximize Output</h2>\n<ul>\n<li>programming: create useful applications. Focus on providing value.</li>\n<li>directory<ul>\n<li>planning: clarify where you want end up in a few years</li>\n<li>figure out how to live the best life possible</li>\n<li>philosophy</li>\n</ul>\n</li>\n</ul>\n<h2 id=\"maximize-input\">Maximize Input</h2>\n<ul>\n<li>college work</li>\n<li>Machine Learning course on Coursera</li>\n<li>reading: increase your knowledge base as much as possible</li>\n<li>learning programming</li>\n</ul>\n<h1 id=\"2-relationships\">2. Relationships</h1>\n<p>The quality of your relationships is strongly correlated with your level of happiness.</p>\n<p>Build relationships that are as meaningful as possible. Focus on quality over quantity.</p>\n<p>Real life interaction is way more valuable than online interaction in general.</p>\n<p>Lower your expectations for your social life to reduce loneliness.</p>\n<h1 id=\"3-experience\">3. Experience</h1>\n<p>First experiences seem to be particularly valuable suggesting that experiences have diminishing returns. For example, seeing a place ten times is much less than ten times as valuable as seeing the place once.</p>\n<p>New experiences slow down the perception of time and make the past seem more &#39;full&#39; in retrospect.</p>\n<h1 id=\"time-division\">Time Division</h1>\n<p>I intend to spend most of my time on work. 40% output, 40% input, 10% on relationships and 10% on experiences sounds like a good split. Though I&#39;ll modify these ratios based on future experience.</p>\n","folder":0},{"path":"home/plans/reviews","name":"Reviews","parent":"home/plans","contents":"<p>Reviews of how I am progressing on my goals for this year.</p>\n","folder":3}]}}
