{"path":"home/work/directory","templateID":2,"sharedPropsHashes":{},"localProps":{"note":{"path":"home/work/directory","name":"Directory","parent":"home/work","contents":"<h1 id=\"directory\">Directory</h1>\n<p>Directory is a collection of my thoughts, ideas, plans and knowledge.</p>\n<h2 id=\"purpose\">Purpose</h2>\n<p>Directory acts as a guide for my actions. My memory is too small for everything I need to know so I&#39;m using Directory to store my most useful ideas, knowledge and values which I can use to make better decisions.</p>\n<p>Thinking about your life consciously is difficult but any effort in this direction is better than none.</p>\n<p>I&#39;ve open-sourced Directory because I believe that knowledge is usually most valuable when shared among as many individuals as possible - sharing knowledge has almost no cost and can be highly beneficial.</p>\n<h2 id=\"technology\">Technology</h2>\n<p>Directory runs on React, but compiles down to Javascript and is served as static files on Github.</p>\n<h2 id=\"other\">Other</h2>\n<p>Directory was created in February 2019</p>\n<p>Directory is inspired by <a href=\"https://directory.gytis.co\">Gytis Daujotas&#39;s Directory</a></p>\n","folder":1},"children_notes":[{"path":"home/work/directory/styleGuide","name":"Style Guide","parent":"home/work/directory","contents":"<h1 id=\"style-guide\">Style Guide</h1>\n<h3 id=\"general\">General</h3>\n<p>Clarify your thinking before you write. Then write clearly and concisely.</p>\n<p>Avoid saying &quot;I think&quot; or similar phrases to for conciseness. It&#39;s implied that everything in directory is your own opinion.</p>\n<p>Focus on quality over quantity.</p>\n<h3 id=\"addition\">Addition</h3>\n<p>Adding to directory takes time so only add particularly useful information. New additions also make editing the whole of directory more difficult.</p>\n<p>Only add something to Directory if all the conditions below are true:</p>\n<ol>\n<li>It can&#39;t easily be found on the internet.</li>\n<li>It is more useful in a written form than in your mind.</li>\n<li>It&#39;s important.</li>\n</ol>\n<h3 id=\"deletion\">Deletion</h3>\n<p>Removing content is useful because it makes editing the whole of Directory easier. </p>\n<h3 id=\"editing\">Editing</h3>\n<p>Editing is very important. It allows you to continually improve your ideas over time while saving the result. The process of editing and saving creates a much better product than a first single draft ever could.</p>\n","folder":0}]}}
