{"path":"home/plans/reviews","templateID":2,"sharedPropsHashes":{},"localProps":{"note":{"path":"home/plans/reviews","name":"Reviews","parent":"home/plans","contents":"<p>Reviews of how I am progressing on my goals for this year.</p>\n","folder":4},"children_notes":[{"path":"home/plans/reviews/feb","name":"Feb","parent":"home/plans/reviews","contents":"<h2 id=\"review-of-philosophy-and-direction\">Review of Philosophy and Direction</h2>\n<p>This month, I feel I&#39;ve made some progress on understanding how to live and other related philosophical issues. So far though, I&#39;ve gained insights only through much mental effort. Recently however, I feel I&#39;ve developed enough of a understanding of many philosophical problems to make faster progress.</p>\n<p>My progress seems to be following an S-curve and I think I&#39;m approaching the middle of the curve. I expect to see diminishing returns soon so I&#39;ll begin concrete planning and execution as opposed to only thinking about things.</p>\n<p>Also, I think I have been more open to new ideas and less mentally rigid in the past month which is an improvement.</p>\n<p><strong>Next month</strong>: clarify your understanding of the source of values and motivation. Solve the direction problem or what you should do. Then create a guide for how to live, and a personal life plan. If you fail to make progress on these philosophical issues or are progressing too slowly, just start executing a backup life plan which you can then refine over time.</p>\n<p>I feel a sense of urgency about solving the problems above. Solving these problems is merely a means to an end where the end is the achievement of goals. Therefore, I need to solve these problems soon. I also think the insights I gain will be valuable to other people who are unsure about what to do.</p>\n<h2 id=\"directory\">Directory</h2>\n<p> Make the core section highly compact. This will ensure that I can edit everything and that I have only very high quality content there. </p>\n<p>Write about only the most general and valuable ideas. I think there is a limited supply of these so I expect the number of contributions I make to directory to decrease over time.</p>\n<h2 id=\"lifestyle\">Lifestyle</h2>\n<p>I&#39;m beginning to appreciate the importance of living a more balanced life. I think I can live a more varied lifestyle with a low impact to my productivity if I manage my time well and work efficiently.</p>\n<p><strong>Social life</strong>: spend more time with people.</p>\n<p><strong>College</strong>: I&#39;ve been getting my work done more quickly which is good.</p>\n<p><strong>Reading</strong>: I&#39;ve realized that thinking is a better use of my time than reading so I&#39;m reducing the amount of time I spend reading. Though bear in mind that the knowledge your acquire from reading supports good thinking. So read a little bit everyday.</p>\n<p><strong>Sleep</strong>: go to bed earlier.</p>\n<p><strong>Diet</strong>: eat a more varied diet and eat more calories.</p>\n<p><strong>mindset</strong>: focus on improving over being competent. Be more open to flaws and failure because they are opportunities to improve. Have more of a growth mindset instead of a fixed mindset.</p>\n","folder":0},{"path":"home/plans/reviews/jan","name":"Jan","parent":"home/plans/reviews","contents":"<h1 id=\"january-2019-review\">January 2019 Review</h1>\n<p>This is a description of how I am progressing towards my goals for 2019.</p>\n<h2 id=\"1-philosophy\">1. Philosophy</h2>\n<h3 id=\"reflection\">Reflection</h3>\n<p>I have recently been thinking about the direction I want my life to take. To figure out which direction I should take, I have been thinking about the nature of value and what we value collectively.</p>\n<p>I feel like I&#39;ve made some progress on understanding value and which futures would be desirable though I still have a high degree of uncertainty about some issues.</p>\n<h3 id=\"what-to-start-and-stop-and-continue-doing\">What to Start and Stop and Continue Doing</h3>\n<p>Reading more about related ideas would help inspire creativity and speed up progress as many of the problems I am thinking about have probably already been solved. Spending more time thinking about these issues would also help me to solve them more quickly.</p>\n<p>I would like to stop getting distracted by narrow questions and ideas so that I can focus on the more general questions that apply to all future situations.</p>\n<p>Going forward, I want to continue thinking about problems related to value. I want to spend more time thinking about these problems because the impact of solving them is high - they only really need to be solved once and they underpin everything that we value. Although many of these problems are difficult, such as whether value accumulates across time, any progress would be highly beneficial because of the importance of the problems and because our intuitive understanding of these problems may be poor.</p>\n<h3 id=\"plan\">Plan</h3>\n<p>Next month I would like to spend more time thinking about fundamental questions about value because the importance of these problems probably dwarfs anything else I would think about. By the end of next month, I want to have a good enough understanding of the value landscape that I can clearly explain my ideas in an essay.</p>\n","folder":0},{"path":"home/plans/reviews/april","name":"April","parent":"home/plans/reviews","contents":"<h1 id=\"work\">Work</h1>\n<p>Last month I planned to learn more programming and build more things. Unfortunately, I don&#39;t think I&#39;ve learned new things as fast as I could have. I think this happened because I didn&#39;t spend enough time on programming.</p>\n<p><strong>Next month</strong>: In the future, learn by doing and breaking down skills into sub-skills should accelerate my rate of learning. Build as many new things as possible as practice. Spend more time on programming.</p>\n<h1 id=\"relationships\">Relationships</h1>\n<p>My social life has been fine. </p>\n<p><strong>Next month:</strong> Continue to reach out to existing friends and make more friends.</p>\n<h1 id=\"experiences\">Experiences</h1>\n<p>I probably could have had more new experiences in the past month. April has passed by fairly quickly and the reason why is possibly because you haven&#39;t had many new experiences.</p>\n<p><strong>Next month</strong>: Make an effort to have travel more and have new experiences.</p>\n<h1 id=\"other\">Other</h1>\n<p>I&#39;d like to get into the habit of meditating everyday to calm my mind and increase focus.</p>\n","folder":0},{"path":"home/plans/reviews/mar","name":"Mar","parent":"home/plans/reviews","contents":"<h1 id=\"last-month-s-goals\">Last Month&#39;s Goals</h1>\n<p>Last month, I planned to solve the problem if know what I would want to do in my long term future. While I don&#39;t think I have a definitive answer, I do think I&#39;m closer to solving it.</p>\n<h1 id=\"work\">Work</h1>\n<h2 id=\"programming\">Programming</h2>\n<p>I&#39;ve been steadily learning more programming over the past month though I could probably be learning a lot faster. </p>\n<p><strong>next month</strong>: continue learning programming and building things but at a faster rate.</p>\n<h2 id=\"thinking\">Thinking</h2>\n<p>I&#39;m sure there are some good ideas somewhere in Directory, but there is still quite a way to go although I know where I&#39;m going with more clarity now and can build on the ideas I have developed in the past.</p>\n<p>Recently I&#39;ve realized (again) that long term planning is important. I (probably) have many decades ahead of me in which to work but will only be in the unique position of being at the start of my career once. Therefore, it I should put as much effort as possible into long term planning to avail of the flexibility I currently have.</p>\n<p>As a discover new and important ideas, it&#39;s becoming increasingly clear that there are &#39;crucial considerations&#39; (a term Nick Bostrom invented) that I still don&#39;t know about. A &#39;crucial consideration is an idea which radically changes the way you think and act. For me, diminishing and accelerating returns and the fact that small changes in the short term amount to large changes in the long term were crucial considerations.</p>\n<p>Unfortunately, from my own experience, I had not the slightest awareness that I was missing a crucial consideration before I discovered one and I&#39;m almost completely blind to future crucial considerations. This means that my lack of awareness of any further crucial considerations is not evidence that there are no other crucial considerations to discover. There are probably many game-changing ideas I don&#39;t know about. The problem though, is that I don&#39;t even know that there are ideas I don&#39;t know about.</p>\n<p>Vigorous searching seems to be the only solution to this problem. Our situation is analogous to an explorer in a dense jungle looking for food. The explorer doesn&#39;t have any idea that he is about to find an apple tree until he actually encounters it. In this situation, foresight is literally useless because the explorer can barely see ahead of himself. The only effective solution to the problem could be to search frantically.</p>\n<p><strong>next month:</strong> question whether your long term plans will fulfill your values. Adjust your plans based on new insights about your values. Create a better long term plan. Discover more crucial considerations. Deal with the consequences of diminishing and accelerating returns.</p>\n<h2 id=\"philosophy\">Philosophy</h2>\n<p>In the recent past, I wanted to find the &#39;right&#39; philosophical framework. Unfortunately, most philosophical frameworks are riddled with problems. According to Nick Bostrom, the solution to this problem is to give some weight to every framework and then adjust the weights based on encountered evidence. For example, you could initially give a egoism a 90% chance of being sound and utilitarianism a 10% chance and then adjust these probabilities based on future evidence.</p>\n<p>The advantage of this approach is that you don&#39;t have the solve the problem on the spot. Instead, the problem is gradually solved over time as your probabilities become more and more appropriate.</p>\n<p><strong>next month</strong>: enumerate the possible frameworks and assign weights to each. Post your result on Directory.</p>\n<h1 id=\"relationships\">Relationships</h1>\n<p>Be either absorbed in some activity or actually spending time with someone. Don&#39;t think about other people because that kind of thinking tends to lead to loneliness from my experience. If you are lonely, shift your attention to some activity.</p>\n<p>Loneliness is the expectation of spending time with people and expectation causes suffering. Expect nothing socially and take each social interaction as it comes.</p>\n<p>Be more outgoing and less self-conscious because thankfully, people care a lot less about you than you naturally think. Also our social instincts were created when &#39;fitting in&#39; had survival value. Since it has a lot less value now, it makes sense to be a lot less concerned with fitting in.</p>\n<p><strong>next month</strong>: be more confident and less anxious. Move outside your comfort zone without embarrassing other people. </p>\n<h1 id=\"experience\">Experience</h1>\n<p>I&#39;ve learned over the past month that real experiences are memorable, more than reading books or watching movies though these activities are still valuable. I suspect they are more memorable because of their multi-sensory nature.</p>\n<p>I&#39;ve also come to appreciate the importance of doing new things. New experiences are more memorable than repeated ones and diminishing returns applies - doing something ten times is less than ten times as valuable as doing it once. Diversify your experiences and focus on new things.</p>\n<p><strong>next month</strong>: have more new, real experiences. </p>\n","folder":0}]}}
