{"path":"home/mind/thinking","templateID":2,"sharedPropsHashes":{},"localProps":{"note":{"path":"home/mind/thinking","name":"Thinking","parent":"home/mind","contents":"<h2 id=\"the-scientific-method\">The Scientific Method</h2>\n<p>The scientific method is one of the most effective ways to find the truth.</p>\n<ol>\n<li><strong>Observation</strong>: you see something that you want to understand.</li>\n<li><strong>Hypothesis</strong>: create a possible explanation of the observation.</li>\n<li><strong>Prediction</strong>: make a prediction based on your experiment.</li>\n<li><strong>Feedback</strong>: how different is the result to your prediction? Then adjust your hypothesis accordingly.</li>\n<li>Continue step 2 to 4 until your hypothesis is as accurate as possible.</li>\n</ol>\n<h2 id=\"first-principles-thinking\">First Principles Thinking</h2>\n<ul>\n<li>First principles are facts that have a very high probability of being correct.</li>\n<li>Example: Newton&#39;s second law of motion.</li>\n<li>First principles are almost impossible to falsify.</li>\n<li>How to find first principles:<ul>\n<li>think of simple facts; it is important that they are simple, otherwise you will probably make a mistake.</li>\n<li>continually try to falsify each truth.</li>\n<li>If you cannot falsify it, then you can accept it as a first principle.</li>\n</ul>\n</li>\n<li>Every further logical step from the first principles must be correct in order to arrive at a conclusion that is correct.</li>\n<li>Resist the temptation to jump to conclusions based on what you know. Continually return to your first principles as they are the only thing you know to be true.</li>\n</ul>\n<h2 id=\"rules-for-thinking-from-rene-descartes\">Rules for thinking from Rene Descartes</h2>\n<ol>\n<li>Divide each problem into as many parts are needed to solve it.</li>\n<li>Order your thoughts from the simple to the complex.</li>\n<li>Always check thoroughly for oversights. (things that you may have missed)</li>\n<li><p>Never accept anything except clear and distinct ideas.</p>\n</li>\n<li><p>Accept as true only what is indubitable.</p>\n</li>\n<li>Divide every question into manageable parts. Begin with the simplest issues and ascend to the more complex. Review frequently enough to retain the whole argument at once.</li>\n</ol>\n<h2 id=\"bayesian-process\">Bayesian Process</h2>\n<p>Bayesian inference is a method where the probability assigned to a hypothesis is updated based on experience. To make your hypotheses better, collect as much information as possible. </p>\n<h2 id=\"creative-thinking\">Creative Thinking</h2>\n<ul>\n<li>Creativity requires inspiration. Consume the work of other people to create.</li>\n<li>To create new ideas:<ul>\n<li>Combine two existing ideas.</li>\n<li>Combine two perceptions (two things you learn from experience).</li>\n<li>Combine an idea with a perception.</li>\n</ul>\n</li>\n</ul>\n<h2 id=\"tips\">Tips</h2>\n<ul>\n<li><em>Always assume that you are to some degree wrong.</em> Acceptance of ignorance leads to knowledge. Many religions think they know the whole truth already and have made no progress as a result.</li>\n<li>Make claims that can be falsified. If a claim is vague, you can&#39;t falsify it, move onto something else and make progress.</li>\n<li>When you are far from the truth, make large changes to your view to get closer to the truth. When you are close to the truth, make small adjustments so that you do not overshoot and end up becoming more wrong.</li>\n<li>Inverting questions is useful. For example, ask what you don&#39;t want if you can&#39;t find what you want.</li>\n<li>Finding the truth is like hitting a target with a bow and arrow. Constant adjustment and feedback is required and you are much more likely to miss the target than hit it.</li>\n<li>Refusing to change your views is only useful once you know you have found the answer. Otherwise you are refusing to become less wrong.</li>\n<li>You need two abilities to improve:<ul>\n<li>the ability to change your world model based on experience.</li>\n<li>the ability to remember your most previous and best model to prevent regression. Writing it down may help with this.</li>\n</ul>\n</li>\n<li><p>Falsification is more powerful than proof - for example, if your believe that all swans are white, finding another white swan doesn&#39;t prove you right but finding a black one proves you wrong. Therefore, negative examples lead to more progress. It&#39;s difficult to try to prove your theories wrong because we suffer from the <em>confirmation bias</em>.</p>\n</li>\n<li><p>Beware of local minimums: sometimes is it better to try a completely different approach then to make progress on your current approach. Sometimes a big jump is required to make progress. Making better and better longbows incrementally would never lead to machine guns. People had to make the leap from longbows to muskets first.</p>\n</li>\n</ul>\n","folder":0},"children_notes":[]}}
