{"path":"home/knowledge","templateID":2,"sharedPropsHashes":{},"localProps":{"note":{"path":"home/knowledge","name":"Knowledge","parent":"home","contents":"","folder":15},"children_notes":[{"path":"home/knowledge/quotes","name":"Quotes","parent":"home/knowledge","contents":"<h1 id=\"quotes\">quotes</h1>\n<p>note: Unlabeled quotes mean I don&#39;t know who said them.</p>\n<h2 id=\"quotes-on-success\">Quotes on Success</h2>\n<ul>\n<li>&quot;Continuous effort - not strength or intelligence - is the key to unlocking our potential&quot; - Winston Churchill</li>\n<li>&quot;Focused hard work is the real key to success.&quot; - John Carmack</li>\n<li>&quot;Ask yourself what you ideal self would do.&quot;</li>\n<li>&quot;Be humble, be hungry and always be the hardest worker in the room.&quot; - Dwayne Johnson</li>\n<li><p>&quot;People err who think my art comes easily to me. I assure you, dear friend, nobody has devoted</p>\n<p> so much time and thought to compisitions as I. There is not a famous master whose music I have not </p>\n<p> industriously studied through many times.&quot; - Mozart, extract from one of his letters</p>\n</li>\n<li><p>&quot;Ceaseless work, analysis, reflection, writing much, endless self-correction, that is my secret.&quot; - J.S. Bach</p>\n</li>\n<li>&quot;Genius is one percent inspiration and ninety-nine percent perspiration.&quot; - Thomas Edison</li>\n<li><p>&quot;The trouble lies in the fact that people do not have an object  - one thing to which they stick, </p>\n<p> letting all else go. Success is the product of the severest kind of mental and physical application.”</p>\n</li>\n<li><p>&quot;The only trouble is that they do it about a great many things and I do it about one. If they </p>\n<p>took the time in question and applied it in one direction, to one object, they would succeed.</p>\n<p>“Success is sure to follow such application. The trouble lies in the fact that people do not </p>\n<p>have an object — one thing to which they stick, letting all else go. Success is the product </p>\n<p>of the severest kind of mental and physical application.&quot; - Thomas Edison</p>\n</li>\n<li><p>&quot;Our greatest weakness lies in giving up. The most certain way to succeed is always to try just</p>\n<p>one more time.&quot; - Thomas Edison</p>\n</li>\n<li><p>Sam Altman has said that the best founders &quot;get things done really quickly.&quot;</p>\n</li>\n<li><p>&quot;I continue to find my greatest pleasure, and so my reward, in the work that precedes </p>\n<p>what the world calls success.&quot; - Thomas Edison</p>\n</li>\n<li><p>&quot;To become better at x, practice x.&quot;</p>\n</li>\n</ul>\n<h2 id=\"quotes-on-life-and-meaning\">Quotes on Life and Meaning</h2>\n<ul>\n<li>&quot;Time lost is never found again.&quot; - Benjamin Franklin</li>\n<li><p>&quot;You want to have a future where you are expecting things to be better, not one where you are expecting </p>\n<p>things to be worse.&quot; - Elon Musk</p>\n</li>\n<li><p>&quot;There is no justice in the laws of nature, no term for fairness in the equations of motion. </p>\n<p>The Universe is neither evil, nor good, it simply does not care. The stars don’t care, or the Sun, or the sky. </p>\n<p>But they don’t have to! WE care! There IS light in the world, and it is US!&quot; - Eliezar Yudkowsky</p>\n</li>\n<li><p>&quot;I think life on Earth must be about more than just solving problems.</p>\n<p>It&#39;s got to be something inspiring, even if it is vicarious.&quot; - Elon Musk</p>\n<p>-&quot;Begin at once to live and count each day as a separate life.&quot; - Seneca</p>\n</li>\n<li><p>&quot;Life, if well lived, is long enough.&quot; - Seneca</p>\n</li>\n<li>&quot;And in the end, it’s not the years in your life that count. It’s the life in your years.&quot; - Abraham Lincoln</li>\n<li>&quot;The days are long, but the decades are short.&quot; - Sam Altman</li>\n<li><p>&quot;The challenge presented by the prospect of superintelligence, and how we might best respond is quite possibly </p>\n<p>the most important and most daunting challenge humanity has ever faced. And - whether we succeed </p>\n<p>or fail - it is probably the last challenge we will ever face.&quot; - Nick Bostrom</p>\n</li>\n<li><p>&quot;Elon Musk is the modern day Nikola Tesla, the world would be a better place if we had 100 of him.&quot; - a youtube comment</p>\n</li>\n<li>&quot;Assuming that the observable universe is void of extraterrestrial civilizations, then what hangs in the balance is at least 10,000,000,000,000,000,000,000,000,000,000,000,000,000,000,000,000,000,000,000 human lives.&quot; - Nick Bostrom</li>\n<li>&quot;At age 20, we worry about what others think of us. At age 40, we don&#39;t care what they think of us. At age 60, we discover they haven&#39;t been thinking of us at all.&quot; - Ann Landers</li>\n<li>&quot;I knew that if I failed I wouldn&#39;t regret that, but I knew the one thing I might regret is not trying.&quot; - Jeff Bezos</li>\n<li>&quot;A lot of people here climbed up the right ladder only to realize that it was propped up against the wrong wall.&quot;</li>\n<li>The most common regret people have at the end of their lives according to palliative nurse Bronnie Ware is, &quot;I wish I’d had the courage to live a life true to myself, not the life others expected of me.&quot;</li>\n</ul>\n<h2 id=\"quotes-on-thought\">Quotes on Thought</h2>\n<ul>\n<li>&quot;Intelligence is the ability to avoid doing work, yet getting the work done.&quot; - Linus Torvalds</li>\n<li><p>&quot;I think it&#39;s very important to have a feedback loop, where you&#39;re constantly thinking about what </p>\n<p>you&#39;ve done and how you could be doing it better. I think that&#39;s the single best piece of advice: </p>\n<p>constantly think about how you could be doing things better and questioning yourself. - Elon Musk</p>\n</li>\n<li><p>&quot;You could try to pound your head against the wall and think of original </p>\n<p>ideas  -  or you can cheat by reading them in books.&quot; - Patrick Collison</p>\n</li>\n<li><p>&quot;“One can speculate that the tardiness and wobbliness of humanity&#39;s progress on many </p>\n<p>of the &quot;eternal problems&quot; of philosophy are due to the unsuitability of the human cortex </p>\n<p>for philosophical work. On this view, our most celebrated philosophers are like dogs </p>\n<p>walking on their hind legs - just barely attaining the threshold level of performance </p>\n<p>required for engaging in the activity at all.” - Nick Bostrom</p>\n</li>\n</ul>\n","folder":0},{"path":"home/knowledge/books","name":"Books","parent":"home/knowledge","contents":"<h1 id=\"books\">books</h1>\n<blockquote>\n<p> <em>&quot;The reading of all good books is like a conversation with the finest minds of past centuries.&quot; - Rene Descartes</em></p>\n</blockquote>\n","folder":1},{"path":"home/knowledge/sources","name":"Sources","parent":"home/knowledge","contents":"<p>Sources are very important. They influence what you think. Therefore, I try to have the best possible sources.</p>\n<h2 id=\"creativity\">Creativity</h2>\n<p>Creativity is new information outputted by your mind. To generate an output there must be input. I&#39;ve found that exposing myself to more new ideas increases my creativity.</p>\n","folder":3},{"path":"home/knowledge/health","name":"Health","parent":"home/knowledge","contents":"<h1 id=\"health\">health</h1>\n<p>This folder is concerned with physical health.</p>\n<p>Health is important because it affects your general quality of life. Good health is also relevant to productivity - it provides you with enough energy to achieve your goals.</p>\n","folder":3},{"path":"home/knowledge/work","name":"Work","parent":"home/knowledge","contents":"<h1 id=\"work\">work</h1>\n<p>This folder contains the things I am currently working on.</p>\n<h2 id=\"what-is-work-\">What is Work?</h2>\n<p>Broadly speaking, work is a set of deliberate actions which result in desirable changes.</p>\n<h1 id=\"productivity-tips\">Productivity Tips</h1>\n<blockquote>\n<p><em>&#39;My system has three key pillars: “Make sure to get the important shit done”, “Don’t waste time on stupid shit”, and “make a lot of lists.&#39; -</em> <a href=\"http://blog.samaltman.com/productivity\"><em>Productivity</em></a><em>, Sam Altman</em></p>\n</blockquote>\n<h2 id=\"break-down-work-into-small-pieces\">Break Down Work Into Small Pieces</h2>\n<p>Our willpower is usually weaker than emotional resistance. The balance can be moved in favor of willpower by breaking large tasks into smaller subtasks. Subtasks require less willpower because they are shorter and easier and cause less emotional resistance because they are less daunting. Create subtasks to beat procrastination and fatigue.</p>\n<h2 id=\"lower-the-activation-energy\">Lower the Activation Energy</h2>\n<p>It&#39;s possible to do ordinary work everyday and achieve extraordinary results in the long term because the work builds up over time. To achieve extraordinary results, consistency is important. Lowering the activation energy required to do work by making work easier to start fosters consistency. For example, you could leave your laptop open on your desk so that you can easily start working on it at any time.</p>\n<h2 id=\"choose-what-you-want-to-work-on-carefully\">Choose What You Want to Work on Carefully</h2>\n<p>The direction you choose for you career matters more than how hard you work. You have to make choices and trade-offs because you don&#39;t have enough time to have many careers. The rational thing to do in response to this problem is to choose the best option based on whatever criteria you care about. Personally, I want to work on the areas that will most affect the future of civilization such as artificial intelligence.</p>\n<blockquote>\n<p><em>&quot;It doesn’t matter how fast you move if it’s in a worthless direction. Picking the right thing to work on is the most important element of productivity and usually almost [always] ignored. So think about it more! Independent thought is hard but it’s something you can get better at with practice.&quot; -</em> <a href=\"http://blog.samaltman.com/productivity\"><em>Productivity</em></a><em>, Sam Altman</em></p>\n</blockquote>\n<h2 id=\"small-improvements-matter\">Small Improvements Matter</h2>\n<p>Small improvements in productivity per day can translate into huge differences in the long term. For example, saving ten minutes per day adds up to sixty hours of saved time per year.</p>\n","folder":3}]}}
