{"path":"home/knowledge/work/zeroSumGames","templateID":2,"sharedPropsHashes":{},"localProps":{"note":{"path":"home/knowledge/work/zeroSumGames","name":"Zero Sum Games","parent":"home/knowledge/work","contents":"<p>Many situations are zero sum where the gain of one person is the loss of another.</p>\n<p>From a utilitarian perspective, the outcome of zero sum games does not matter. Imagine a God looking down at the flow of money. From its perspective, money just moves from place to place without changing the overall sum of money.</p>\n<p>However, the outcomes of zero sum games matter from an egoistic perspective. If two thieves wrestle over a gem, there is one gem to be had between two people so either outcome is neutral from a utilitarian perspective but not from an egoistic perspective. If thief A wins, he gets the gem. If he loses, thief B gets the gem and thief A doesn&#39;t.</p>\n<p>If you are thief A, assuming that you value yourself more than thief B, it makes sense to maximize the probability of winning the wrestle and getting the diamond.</p>\n<h2 id=\"how-to-win-zero-sum-games\">How to win Zero Sum Games</h2>\n<p>Expected value = size of reward x probability of getting the reward</p>\n<p>Assuming you have a goal in mind, increase the expected value by increasing the probability of success.</p>\n<h3 id=\"select-weaker-competitors\">Select Weaker Competitors</h3>\n<p>More generally, how do you win zero sum games. Zero sum games are fundamentally relative competitions.  To win them, you need to be better than your competitor(s). One way of improving your odds is to choose weak competitors. For instance, a football team with the choice between playing a weak and a strong team to get to the next round in a league should choose the weak team. Beating either team has the same reward - getting to the next round - but the team has a higher probability of beating the weak team so the expected value is higher.</p>\n<h3 id=\"increase-your-level-of-competence\">Increase Your Level of Competence</h3>\n<p>Increasing your competence increases your chance of winning in a competition. If you lie right in the middle of the bell curve, then your chance of winning against a random competitor is 50%. If your level of competence is at the 90th percentile, you have a 90% percent chance of beating a random competitor since most of your competitors will be average which is worse than you. Therefore, become as effective as possible to maximize your chance of winning competitions.</p>\n<p>In <a href=\"https://directory.stephenmcaleese.net/home/mind/improvement\">this</a> article I explain how to improve.</p>\n","folder":0},"children_notes":[]}}
