{"path":"home/knowledge/work","templateID":2,"sharedPropsHashes":{},"localProps":{"note":{"path":"home/knowledge/work","name":"Work","parent":"home/knowledge","contents":"<h1 id=\"work\">work</h1>\n<p>This folder contains the things I am currently working on.</p>\n<h2 id=\"what-is-work-\">What is Work?</h2>\n<p>Broadly speaking, work is a set of deliberate actions which result in desirable changes.</p>\n<h2 id=\"productivity-tips\">Productivity Tips</h2>\n<blockquote>\n<p><em>&#39;My system has three key pillars: “Make sure to get the important shit done”, “Don’t waste time on stupid shit”, and “make a lot of lists.&#39; -</em> <a href=\"http://blog.samaltman.com/productivity\"><em>Productivity</em></a><em>, Sam Altman</em></p>\n</blockquote>\n<h2 id=\"choose-what-you-want-to-work-on-carefully\">Choose What You Want to Work on Carefully</h2>\n<p>The direction you choose for you career matters more than how hard you work. You have to make choices and trade-offs because you don&#39;t have enough time to have many careers. The rational thing to do in response to this problem is to choose the best option based on whatever criteria you care about. Personally, I want to work on the areas that will most affect the future of civilization such as artificial intelligence.</p>\n<blockquote>\n<p><em>&quot;It doesn’t matter how fast you move if it’s in a worthless direction. Picking the right thing to work on is the most important element of productivity and usually almost [always] ignored. So think about it more! Independent thought is hard but it’s something you can get better at with practice.&quot; -</em> <a href=\"http://blog.samaltman.com/productivity\"><em>Productivity</em></a><em>, Sam Altman</em></p>\n</blockquote>\n<h2 id=\"small-improvements-matter\">Small Improvements Matter</h2>\n<p>Small improvements in productivity per day can translate into huge differences in the long term. For example, saving ten minutes per day adds up to sixty hours of saved time per year.</p>\n","folder":0},"children_notes":[]}}
