{"path":"home/mind/emotion/sexuality","templateID":2,"sharedPropsHashes":{},"localProps":{"note":{"path":"home/mind/emotion/sexuality","name":"Sexuality","parent":"home/mind/emotion","contents":"<p>Your sexuality is an important part of your emotional and psychological well-being.</p>\n","folder":1},"children_notes":[{"path":"home/mind/emotion/sexuality/howToFindYourSexuality","name":"How To Find Your Sexuality","parent":"home/mind/emotion/sexuality","contents":"<p>Get the tinder app.</p>\n<p>Initially, display only women/men in your age range of choice.</p>\n<p>Out of one hundred swipes, record how many of them were to the right.</p>\n<p>To make this easier, I split up the task into ten groups of ten swipes, then added up the total number of right swipes and divided by one hundred to find the percentage of right swipes for each gender.</p>\n<p>For higher accuracy, ask this question, &quot;Would I want to go on a date with this person?&quot;. Swipe right if the answer is yes, otherwise swipe left. Also, be honest about your swipes.</p>\n<p>Now change the gender displayed to the opposite gender keeping the age range the same. Keep all other variables the same.</p>\n<p>Out of one hundred swipes of this gender (the opposite of the initial gender), record how many were to the right.</p>\n<p>Compare the number of right swipes for each gender. If you have a high percentage of right swipes for the opposite gender and a low percentage for your gender, then you are probably heterosexual. If you found the opposite pattern, then you are probably homosexual. A balanced percentage of right swipes between both genders suggests that you are bisexual.</p>\n<p>Note: this test only determines your preferences for physical attractiveness.</p>\n<h2 id=\"my-result\">My Result</h2>\n<p>I found that I swiped 58% (based on 100 swipes) to the right for both genders (in my age range: 18 - 22). Coincidentally, the figure happened to be exactly 58% for both genders!</p>\n<p>This means that, according to the data I&#39;ve collected, I am exactly bisexual - right between heterosexual and homosexual. However, there is bound to be some inaccuracies in this result so I&#39;d say I&#39;m roughly, as opposed to exactly bisexual. In other words, I might have a slight lean towards either gender.</p>\n","folder":0}]}}
