{"path":"home/plans/reviews/jan","templateID":2,"sharedPropsHashes":{},"localProps":{"note":{"path":"home/plans/reviews/jan","name":"Jan","parent":"home/plans/reviews","contents":"<h1 id=\"january-2019-review\">January 2019 Review</h1>\n<p>This is a description of how I am progressing towards my goals for 2019.</p>\n<h2 id=\"1-philosophy\">1. Philosophy</h2>\n<h3 id=\"reflection\">Reflection</h3>\n<p>I have recently been thinking about the direction I want my life to take. To figure out which direction I should take, I have been thinking about the nature of value and what we value collectively.</p>\n<p>I feel like I&#39;ve made some progress on understanding value and which futures would be desirable though I still have a high degree of uncertainty about some issues.</p>\n<h3 id=\"what-to-start-and-stop-and-continue-doing\">What to Start and Stop and Continue Doing</h3>\n<p>Reading more about related ideas would help inspire creativity and speed up progress as many of the problems I am thinking about have probably already been solved. Spending more time thinking about these issues would also help me to solve them more quickly.</p>\n<p>I would like to stop getting distracted by narrow questions and ideas so that I can focus on the more general questions that apply to all future situations.</p>\n<p>Going forward, I want to continue thinking about problems related to value. I want to spend more time thinking about these problems because the impact of solving them is high - they only really need to be solved once and they underpin everything that we value. Although many of these problems are difficult, such as whether value accumulates across time, any progress would be highly beneficial because of the importance of the problems and because our intuitive understanding of these problems may be poor.</p>\n<h3 id=\"plan\">Plan</h3>\n<p>Next month I would like to spend more time thinking about fundamental questions about value because the importance of these problems probably dwarfs anything else I would think about. By the end of next month, I want to have a good enough understanding of the value landscape that I can clearly explain my ideas in an essay.</p>\n","folder":0},"children_notes":[]}}
