{"path":"home/mind/howToMakeDecisions","templateID":2,"sharedPropsHashes":{},"localProps":{"note":{"path":"home/mind/howToMakeDecisions","name":"How To Make Decisions","parent":"home/mind","contents":"<p>Making long term decisions is difficult because there is a lot of uncertainty about what might happen.</p>\n<p>Applying a decision making process can help.</p>\n<h2 id=\"how-to-make-decisions\">How to Make Decisions</h2>\n<ol>\n<li>List out as many outcomes as possible.</li>\n<li><p>Assign a probability to each outcome. Doing some research might help. (see <a href=\"https://en.wikipedia.org/wiki/Bayesian_inference\">bayesian inference</a>)</p>\n</li>\n<li><p>Figure out how valuable each outcome would be. Create metrics for each outcome if possible to make this easier. For example, if you are choosing a job, the relevant metrics could be income, how much you would enjoy the job on a scale of one to ten and how meaningful the job would be (how much of a positive impact the job would have on the world). The last metric is trickier to measure. Maybe you could measure impact by the number of people you expect your job to reach. If you don&#39;t know, just assign values to a metric intuitively (eg. a famous artist would have more impact than a low-level corporate worker). </p>\n</li>\n<li>For each outcome, multiply the probability of success by the value. </li>\n<li>Choose the outcomes with the highest resulting value.</li>\n</ol>\n<h2 id=\"examples-of-this-process-in-action\">Examples of this Process in Action</h2>\n<h3 id=\"low-probability-high-consequences\">Low probability, high consequences</h3>\n<p>Why does wearing a seatbelt make sense if the probability of a car crash is so low? The reason why is that the consequences of a car crash are high.</p>\n<p><em>importance of wearing a seatbelt = probability of crash(low) x consequences of crash(very high)</em></p>\n<p>The consequences of a crash outweigh the low probability making it important to wear a seatbelt.</p>\n<h3 id=\"high-probability-high-consequences\">High probability, high consequences</h3>\n<p>Unfinished</p>\n","folder":0},"children_notes":[]}}
