{"path":"home/plans/reviews/mar","templateID":2,"sharedPropsHashes":{},"localProps":{"note":{"path":"home/plans/reviews/mar","name":"Mar","parent":"home/plans/reviews","contents":"<h1 id=\"last-month-s-goals\">Last Month&#39;s Goals</h1>\n<p>Last month, I planned to solve the problem if know what I would want to do in my long term future. While I don&#39;t think I have a definitive answer, I do think I&#39;m closer to solving it.</p>\n<h1 id=\"work\">Work</h1>\n<h2 id=\"programming\">Programming</h2>\n<p>I&#39;ve been steadily learning more programming over the past month though I could probably be learning a lot faster. </p>\n<p><strong>next month</strong>: continue learning programming and building things but at a faster rate.</p>\n<h2 id=\"thinking\">Thinking</h2>\n<p>I&#39;m sure there are some good ideas somewhere in Directory, but there is still quite a way to go although I know where I&#39;m going with more clarity now and can build on the ideas I have developed in the past.</p>\n<p>Recently I&#39;ve realized (again) that long term planning is important. I (probably) have many decades ahead of me in which to work but will only be in the unique position of being at the start of my career once. Therefore, it I should put as much effort as possible into long term planning to avail of the flexibility I currently have.</p>\n<p>As a discover new and important ideas, it&#39;s becoming increasingly clear that there are &#39;crucial considerations&#39; (a term Nick Bostrom invented) that I still don&#39;t know about. A &#39;crucial consideration is an idea which radically changes the way you think and act. For me, diminishing and accelerating returns and the fact that small changes in the short term amount to large changes in the long term were crucial considerations.</p>\n<p>Unfortunately, from my own experience, I had not the slightest awareness that I was missing a crucial consideration before I discovered one and I&#39;m almost completely blind to future crucial considerations. This means that my lack of awareness of any further crucial considerations is not evidence that there are no other crucial considerations to discover. There are probably many game-changing ideas I don&#39;t know about. The problem though, is that I don&#39;t even know that there are ideas I don&#39;t know about.</p>\n<p>Vigorous searching seems to be the only solution to this problem. Our situation is analogous to an explorer in a dense jungle looking for food. The explorer doesn&#39;t have any idea that he is about to find an apple tree until he actually encounters it. In this situation, foresight is literally useless because the explorer can barely see ahead of himself. The only effective solution to the problem could be to search frantically.</p>\n<p><strong>next month:</strong> question whether your long term plans will fulfill your values. Adjust your plans based on new insights about your values. Create a better long term plan. Discover more crucial considerations. Deal with the consequences of diminishing and accelerating returns.</p>\n<h2 id=\"philosophy\">Philosophy</h2>\n<p>In the recent past, I wanted to find the &#39;right&#39; philosophical framework. Unfortunately, most philosophical frameworks are riddled with problems. According to Nick Bostrom, the solution to this problem is to give some weight to every framework and then adjust the weights based on encountered evidence. For example, you could initially give a egoism a 90% chance of being sound and utilitarianism a 10% chance and then adjust these probabilities based on future evidence.</p>\n<p>The advantage of this approach is that you don&#39;t have the solve the problem on the spot. Instead, the problem is gradually solved over time as your probabilities become more and more appropriate.</p>\n<p><strong>next month</strong>: enumerate the possible frameworks and assign weights to each. Post your result on Directory.</p>\n<h1 id=\"relationships\">Relationships</h1>\n<p>Be either absorbed in some activity or actually spending time with someone. Don&#39;t think about other people because that kind of thinking tends to lead to loneliness from my experience. If you are lonely, shift your attention to some activity.</p>\n<p>Loneliness is the expectation of spending time with people and expectation causes suffering. Expect nothing socially and take each social interaction as it comes.</p>\n<p>Be more outgoing and less self-conscious because thankfully, people care a lot less about you than you naturally think. Also our social instincts were created when &#39;fitting in&#39; had survival value. Since it has a lot less value now, it makes sense to be a lot less concerned with fitting in.</p>\n<p><strong>next month</strong>: be more confident and less anxious. Move outside your comfort zone without embarrassing other people. </p>\n<h1 id=\"experience\">Experience</h1>\n<p>I&#39;ve learned over the past month that real experiences are memorable, more than reading books or watching movies though these activities are still valuable. I suspect they are more memorable because of their multi-sensory nature.</p>\n<p>I&#39;ve also come to appreciate the importance of doing new things. New experiences are more memorable than repeated ones and diminishing returns applies - doing something ten times is less than ten times as valuable as doing it once. Diversify your experiences and focus on new things.</p>\n<p><strong>next month</strong>: have more new, real experiences. </p>\n","folder":0},"children_notes":[]}}
