{"path":"home/mind","templateID":2,"sharedPropsHashes":{},"localProps":{"note":{"path":"home/mind","name":"Mind","parent":"home","contents":"<p>Your mind affects every part of your life. Therefore it&#39;s important to optimize it.</p>\n","folder":9},"children_notes":[{"path":"home/mind/howToAvoidDecisionParalysis","name":"How To Avoid Decision Paralysis","parent":"home/mind","contents":"<h1 id=\"how-to-avoid-decision-paralysis\">How to Avoid Decision Paralysis</h1>\n<p>When you think about what to do with your live, decision paralysis can take hold. It&#39;s difficult to know what to do when there are so many possibilities. For example, there are hundreds of careers to choose from so how do you choose one?</p>\n<p>I think it&#39;s important to avoid what I call the trap of opportunity cost. We often know what we want to do but forgo doing it because we know there could be a better option. That is the trap at play. </p>\n<p>Instead, focus on making your life as good as possible. Have the goal of improving your life rather than avoiding opportunity cost.</p>\n<p>The reason why is that the opportunity cost trap is fundamentally self-defeating. You will never attain perfection so stop trying. Just keep making your life better and accept that there are always going to be flaws in your life.</p>\n","folder":0},{"path":"home/mind/howToBeSmart","name":"How To Be Smart","parent":"home/mind","tags":["Not started"],"contents":"","folder":0},{"path":"home/mind/howToFindTheTruth","name":"How To Find The Truth","parent":"home/mind","contents":"<h2 id=\"the-scientific-method\">The Scientific Method</h2>\n<p>The scientific method is one of the most effective ways to find the truth.</p>\n<ol>\n<li><strong>Observation</strong>: you see something that you want to understand.</li>\n<li><strong>Hypothesis</strong>: create a possible explanation of the observation.</li>\n<li><strong>Prediction</strong>: make a prediction based on your experiment.</li>\n<li><strong>Feedback</strong>: how different is the result to your prediction? Then adjust your hypothesis accordingly.</li>\n<li>Continue step 2 to 4 until your hypothesis is as accurate as possible.</li>\n</ol>\n<h3 id=\"first-principles-thinking\">First Principles Thinking</h3>\n<ul>\n<li>First principles are facts that have a very high probability of being correct.</li>\n<li>Example: Newton&#39;s second law of motion.</li>\n<li>First principles are almost impossible to falsify.</li>\n<li>How to find first principles:<ul>\n<li>think of simple facts; it is important that they are simple, otherwise you will probably make a mistake.</li>\n<li>continually try to falsify each truth.</li>\n<li>If you cannot falsify it, then you can accept it as a first principle.</li>\n</ul>\n</li>\n<li>Every further logical step from the first principles must be correct in order to arrive at a conclusion that is correct.</li>\n</ul>\n<h3 id=\"rules-for-thinking-from-rene-descartes-\">Rules for thinking from Rene Descartes:</h3>\n<ol>\n<li>Divide each problem into as many parts are needed to solve it.</li>\n<li>Order your thoughts from the simple to the complex.</li>\n<li>Always check thoroughly for oversights. (things that you may have missed)</li>\n<li><p>Never accept anything except clear and distinct ideas.</p>\n</li>\n<li><p>Accept as true only what is indubitable.</p>\n</li>\n<li>Divide every question into manageable parts. Begin with the simplest issues and ascend to the more complex. Review frequently enough to retain the whole argument at once.</li>\n</ol>\n<h3 id=\"how-to-think-creatively-\">How to think creatively:</h3>\n<ul>\n<li>Substitute something for another.</li>\n<li>Combine two ideas.</li>\n<li>Adapt: change another idea to create a new idea.</li>\n<li>Magnify</li>\n<li>Put to another use?</li>\n<li>Eliminate?</li>\n<li>Rearrange or reverse?</li>\n</ul>\n<h3 id=\"tips\">Tips</h3>\n<ul>\n<li>When you are far from the truth, make large changes to your view to get closer to the truth. When you are close to the truth, make small adjustments so that you do not overshoot and end up becoming more wrong.</li>\n<li>If you are very wrong, inverting your reasoning may help.</li>\n<li>Remember that your goal is to become less wrong. Your degree of error is always positive or zero. The goal is to have an error of zero but this is rarely achieved in the real world.</li>\n<li>Finding the truth is like hitting a target with a bow and arrow. Constant adjustment and feedback is required and you are much more likely to miss the target than hit it.</li>\n<li>Refusing to change your views is only useful once you know you have found the answer. Otherwise you are refusing to become less wrong.</li>\n<li>You need two abilities to improve:<ul>\n<li>the ability to change your world model based on experience.</li>\n<li>the ability to remember your most previous and best model to prevent regression. Writing it down may help with this.</li>\n</ul>\n</li>\n<li>Falsification is more powerful than proof.</li>\n<li>Example: hypothesis: All Americans are nice. Finding a single mean American would invalidate this hypothesis.</li>\n</ul>\n<p>Unfortunately, we are inclined towards confirming what we believe rather than falsifying it even though falsification often leads you to the truth faster.</p>\n<ul>\n<li>Beware of local minimums: sometimes is it better to try a completely different approach then to make progress on your current approach.</li>\n</ul>\n","folder":0},{"path":"home/mind/howToMakeDecisions","name":"How To Make Decisions","parent":"home/mind","contents":"<p>Making long term decisions is difficult because there is a lot of uncertainty about what might happen.</p>\n<p>Applying a decision making process can help.</p>\n<h2 id=\"how-to-make-decisions\">How to Make Decisions</h2>\n<ol>\n<li>List out as many outcomes as possible.</li>\n<li><p>Assign a probability to each outcome. Doing some research might help. (see <a href=\"https://en.wikipedia.org/wiki/Bayesian_inference\">bayesian inference</a>)</p>\n</li>\n<li><p>Figure out how valuable each outcome would be. Create metrics for each outcome if possible to make this easier. For example, if you are choosing a job, the relevant metrics could be income, how much you would enjoy the job on a scale of one to ten and how meaningful the job would be (how much of a positive impact the job would have on the world). The last metric is trickier to measure. Maybe you could measure impact by the number of people you expect your job to reach. If you don&#39;t know, just assign values to a metric intuitively (eg. a famous artist would have more impact than a low-level corporate worker). </p>\n</li>\n<li>For each outcome, multiply the probability of success by the value. </li>\n<li>Choose the outcomes with the highest resulting value.</li>\n</ol>\n<h2 id=\"examples-of-this-process-in-action\">Examples of this Process in Action</h2>\n<h3 id=\"low-probability-high-consequences\">Low probability, high consequences</h3>\n<p>Why does wearing a seatbelt make sense if the probability of a car crash is so low? The reason why is that the consequences of a car crash are high.</p>\n<p><em>importance of wearing a seatbelt = probability of crash(low) x consequences of crash(very high)</em></p>\n<p>The consequences of a crash outweigh the low probability making it important to wear a seatbelt.</p>\n<h3 id=\"high-probability-high-consequences\">High probability, high consequences</h3>\n<p>Unfinished</p>\n","folder":0},{"path":"home/mind/improvement","name":"Improvement","parent":"home/mind","contents":"<p>The importance of luck for success is much lower when improvement is taken into account. An unlucky person can start in a bad position but rapidly improve succeed. It&#39;s also possible for a lucky person to squander their advantages by not improving and fail. Therefore it&#39;s important to improve if you want to achieve your goals.</p>\n<h2 id=\"fundamentals\">Fundamentals</h2>\n<p>Improvement requires these things:</p>\n<ol>\n<li>a clearly defined goal</li>\n<li>change</li>\n<li>a filter that removes bad changes and keeps good ones</li>\n</ol>\n<h2 id=\"evolution-an-example-of-an-improvement-process\">Evolution - An Example of an Improvement Process</h2>\n<p>Evolution has produced phenomenal improvements in the past few hundred million years. This was possible because the evolutionary process had the three features above. The &#39;goal&#39; of evolution is to keep genes in existence as effectively as possible by designing organisms that is survive and reproduce as effectively as possible. Random mutations in DNA are the source of change and environmental pressures are the filter - animals that can&#39;t survive die and better adapted ones survive. Note that evolution&#39;s filter is perfectly suited to achieving survival - if the goal is the survival of genes, a filter that removes genes that are not good at surviving is the best possible filter as it&#39;s perfectly in line with the goal.</p>\n","folder":0},{"path":"home/mind/thinking","name":"Thinking","parent":"home/mind","contents":"<h2 id=\"the-scientific-method\">The Scientific Method</h2>\n<p>The scientific method is one of the most effective ways to find the truth.</p>\n<ol>\n<li><strong>Observation</strong>: you see something that you want to understand.</li>\n<li><strong>Hypothesis</strong>: create a possible explanation of the observation.</li>\n<li><strong>Prediction</strong>: make a prediction based on your experiment.</li>\n<li><strong>Feedback</strong>: how different is the result to your prediction? Then adjust your hypothesis accordingly.</li>\n<li>Continue step 2 to 4 until your hypothesis is as accurate as possible.</li>\n</ol>\n<h2 id=\"first-principles-thinking\">First Principles Thinking</h2>\n<ul>\n<li>First principles are facts that have a very high probability of being correct.</li>\n<li>Example: Newton&#39;s second law of motion.</li>\n<li>First principles are almost impossible to falsify.</li>\n<li>How to find first principles:<ul>\n<li>think of simple facts; it is important that they are simple, otherwise you will probably make a mistake.</li>\n<li>continually try to falsify each truth.</li>\n<li>If you cannot falsify it, then you can accept it as a first principle.</li>\n</ul>\n</li>\n<li>Every further logical step from the first principles must be correct in order to arrive at a conclusion that is correct.</li>\n<li>Resist the temptation to jump to conclusions based on what you know. Continually return to your first principles as they are the only thing you know to be true.</li>\n</ul>\n<h2 id=\"rules-for-thinking-from-rene-descartes\">Rules for thinking from Rene Descartes</h2>\n<ol>\n<li>Divide each problem into as many parts are needed to solve it.</li>\n<li>Order your thoughts from the simple to the complex.</li>\n<li>Always check thoroughly for oversights. (things that you may have missed)</li>\n<li><p>Never accept anything except clear and distinct ideas.</p>\n</li>\n<li><p>Accept as true only what is indubitable.</p>\n</li>\n<li>Divide every question into manageable parts. Begin with the simplest issues and ascend to the more complex. Review frequently enough to retain the whole argument at once.</li>\n</ol>\n<h2 id=\"bayesian-process\">Bayesian Process</h2>\n<p>Bayesian inference is a method where the probability assigned to a hypothesis is updated based on experience. To make your hypotheses better, collect as much information as possible. </p>\n<h2 id=\"creative-thinking\">Creative Thinking</h2>\n<ul>\n<li>Creativity requires inspiration. Consume the work of other people to create.</li>\n<li>To create new ideas:<ul>\n<li>Combine two existing ideas.</li>\n<li>Combine two perceptions (two things you learn from experience).</li>\n<li>Combine an idea with a perception.</li>\n</ul>\n</li>\n</ul>\n<h2 id=\"tips\">Tips</h2>\n<ul>\n<li><em>Always assume that you are to some degree wrong.</em> Acceptance of ignorance leads to knowledge. Many religions think they know the whole truth already and have made no progress as a result.</li>\n<li>Make claims that can be falsified. If a claim is vague, you can&#39;t falsify it, move onto something else and make progress.</li>\n<li>When you are far from the truth, make large changes to your view to get closer to the truth. When you are close to the truth, make small adjustments so that you do not overshoot and end up becoming more wrong.</li>\n<li>Inverting questions is useful. For example, ask what you don&#39;t want if you can&#39;t find what you want.</li>\n<li>Finding the truth is like hitting a target with a bow and arrow. Constant adjustment and feedback is required and you are much more likely to miss the target than hit it.</li>\n<li>Refusing to change your views is only useful once you know you have found the answer. Otherwise you are refusing to become less wrong.</li>\n<li>You need two abilities to improve:<ul>\n<li>the ability to change your world model based on experience.</li>\n<li>the ability to remember your most previous and best model to prevent regression. Writing it down may help with this.</li>\n</ul>\n</li>\n<li><p>Falsification is more powerful than proof - for example, if your believe that all swans are white, finding another white swan doesn&#39;t prove you right but finding a black one proves you wrong. Therefore, negative examples lead to more progress. It&#39;s difficult to try to prove your theories wrong because we suffer from the <em>confirmation bias</em>.</p>\n</li>\n<li><p>Beware of local minimums: sometimes is it better to try a completely different approach then to make progress on your current approach. Sometimes a big jump is required to make progress. Making better and better longbows incrementally would never lead to machine guns. People had to make the leap from longbows to muskets first.</p>\n</li>\n</ul>\n","folder":0},{"path":"home/mind/emotion","name":"Emotion","parent":"home/mind","contents":"<p>Emotions have a strong influence over our actions, and are probably a stronger determinant of what we do than our thoughts. Therefore, it&#39;s important to manage them if you want to live your life according to your intentions. </p>\n<blockquote>\n<p> <em>&quot;Is freedom anything else than the right to live as we wish? Nothing else.&quot; - Epictetus</em></p>\n</blockquote>\n<p>Sometimes emotions can stop us from living the way we intend. To live as freely as possible, we need to be able to regulate emotions when they are not appropriate to the situation at hand.</p>\n<h1 id=\"emotional-regulation\">Emotional Regulation</h1>\n<p>How to reduce emotions when they are not appropriate or useful:</p>\n<ul>\n<li><strong>Name emotions:</strong> Simply naming the emotion you are currently feeling helps to reduce its intensity. Say, &quot;I am&quot; followed by the emotion you are feeling.<a href=\"https://www.6seconds.org/2018/01/21/getting-unstuck-power-naming-emotions/\"><sup>1</sup></a></li>\n</ul>\n<h2 id=\"stress-reduction\">Stress Reduction</h2>\n<h3 id=\"short-term-techniques\">Short Term Techniques</h3>\n<ul>\n<li><strong>Focus on what you can control</strong>: re-frame situations so that you feel more in control by focusing on what you can control. <a href=\"https://www.sciencefocus.com/the-human-body/10-scientifically-proven-tips-to-beat-stress/\"><sup>2</sup></a></li>\n<li><strong>Take deep breaths</strong> <a href=\"https://www.stress.org/take-a-deep-breath\"><sup>3</sup></a></li>\n</ul>\n<h3 id=\"long-term-management\">Long Term Management</h3>\n<ul>\n<li><strong>Get regular exercise</strong></li>\n<li><strong>Get enough sleep</strong></li>\n</ul>\n","folder":2}]}}
