{"path":"/","templateID":0,"sharedPropsHashes":{},"localProps":{"children_notes":[{"path":"home/philosophy","name":"Philosophy","parent":"home","contents":"<p>In terms of what I believe the most likely to be true, I am a:</p>\n<ul>\n<li><a href=\"https://en.wikipedia.org/wiki/Determinism\">Hard determinist</a>, meaning that free will is impossible and your choices are a result of some conbination of your nature and nurture</li>\n<li><a href=\"https://en.wikipedia.org/wiki/Eliminative_materialism\">Eliminative materialist</a>, meaning that, in particular, consciousness does not exist, and the term will be eventually eliminated as neuroscience progresses</li>\n<li><a href=\"https://en.wikipedia.org/wiki/Absurdism\">Absurdist</a>, meaning that you must awknowledge that there is no meaning or purpose to our lives and universe, but despite this, our biology demands we pursue it and believe in it</li>\n</ul>\n","folder":2},{"path":"home/essays","name":"Essays","parent":"home","contents":"","folder":2},{"path":"home/emotion","name":"Emotion","parent":"home","contents":"<p>People consistently underestimate how much less competent they are when they are unhappy.</p>\n<p>Sam mentions a pattern which sometimes applies to me:</p>\n<blockquote>\n<p>Like most people, I sometimes go through periods of a week or two where I just have no motivation to do anything (I suspect it may have something to do with nutrition).  This sucks and always seems to happen at inconvenient times.  I have not figured out what to do about it besides wait for the fog to lift, and to trust that eventually it always does.  And I generally try to avoid people and situations that put me in bad moods, which is good advice whether you care about productivity or not. - <a href=\"http://blog.samaltman.com/productivity\">Productivity, Sam Altman</a></p>\n</blockquote>\n<p>I can&#39;t get the motivation and enthusiasm to do productive work on some days. This is usually solved by going outside or socializing more. It probably is also helped by taking small amounts of time off for leisure.</p>\n<h2 id=\"winter\">Winter</h2>\n<p>Ireland has the misfortune of being one of the countries with the least amount of sunlight hours.</p>\n<p>Sometimes, the lack of sunlight can be really demotivating. So far, what I&#39;ve found that works is keeping a journal with a list of sequential bullet-pointed tasks for your day, so that there is never any doubt about what&#39;s next. The smaller the tasks are the better.</p>\n","folder":9},{"path":"home/knowledge","name":"Knowledge","parent":"home","contents":"","folder":13},{"path":"home/resources","name":"Resources","parent":"home","contents":"<h1 id=\"base-philosophy\">Base philosophy</h1>\n<p>Resources, like time and money, are scarce. A lot of what we do is finding different ways to transform, manage, and control these resources.</p>\n<h2 id=\"goals\">Goals</h2>\n<p>Resources like time and money don&#39;t matter to us unless we can redirect them to fill our values. It follows that the best way to manage these resources is to ensure we&#39;ve used them to fulfill our values as best as we could.</p>\n<p>For example, imagine you&#39;re a millionare who can&#39;t take time off. The value of you having money, which fulfills your ego, could be less than the value of having free time, enjoying your life, and living out your days. The best move would then be to quit and slowly spend your money while you&#39;re still alive.</p>\n<p>This presents interesting challenges in our lives. It can sometimes be a perplexing juggling act trying to figure out which scenario makes your life more valuable. What we know for sure is that making any attempt to make an informed choice is probably better than being completely ignorant, so just by keeping your values in mind, you&#39;ll probably get a very good outcome regardless.</p>\n","folder":5},{"path":"home/work","name":"Work","parent":"home","contents":"","folder":4},{"path":"home/strategy","name":"Strategy","parent":"home","contents":"","folder":16}]}}
