{"path":"/","templateID":0,"sharedPropsHashes":{},"localProps":{"children_notes":[{"path":"home/essays","name":"Essays","parent":"home","tags":["Not started"],"contents":"","folder":0},{"path":"home/resources","name":"Resources","parent":"home","contents":"<p>Money, time and energy are usually scarce and therefore are valuable.</p>\n","folder":3},{"path":"home/philosophy","name":"Philosophy","parent":"home","contents":"<blockquote>\n<p>*&quot;The unexamined life is not worth living.&quot; - Socrates</p>\n</blockquote>\n<p>Below is a list of philosophical ideas I support.</p>\n<p><a href=\"https://en.wikipedia.org/wiki/Determinism\">Determinism:</a> the idea that all events are determined by past events. An important implication of determinism is that free will is not possible. Since our actions are determined by past experiences and genes, our decisions are bounded by the past making free will impossible.</p>\n<p><a href=\"https://en.wikipedia.org/wiki/Absurdism\">Absurdism:</a> the scientific evidence we have accumulated so far suggests that the creation of our universe was a random improbable event and that there is no intrinsic meaning in the universe. One of the core ideas of absurdism is the human struggle to find meaning and purpose in an intrinsically meaningless universe.</p>\n<p><a href=\"https://en.wikipedia.org/wiki/Fallibilism\">Fallibilism</a>: there are no facts which are one-hundred percent true. All knowledge is to some degree uncertain because imperfect perceptions are the source of all knowledge.</p>\n","folder":1},{"path":"home/knowledge","name":"Knowledge","parent":"home","contents":"","folder":10},{"path":"home/plans","name":"Plans","parent":"home","contents":"<p>Some future plans I have and reviews on how well I am following them.</p>\n","folder":4},{"path":"home/work","name":"Work","parent":"home","contents":"<p>Things I am currently working on</p>\n","folder":3},{"path":"home/mind","name":"Mind","parent":"home","contents":"<p>Your mind affects every part of your life. Therefore it&#39;s important to optimize it.</p>\n","folder":10}]}}
